trevorcmit/DA14585_RCU/SDK_585/sdk/platform/arch/main/arch_main.c
/**
 ****************************************************************************************
 *
 * @file arch_main.c
 *
 * @brief Main loop of the application.
 *
 * Copyright (C) 2012 Dialog Semiconductor.
 * This computer program includes Confidential, Proprietary Information
 * of Dialog Semiconductor. All Rights Reserved.
 *
 * <bluetooth.support@diasemi.com> and contributors.
 *
 ****************************************************************************************
 */

/*
 * INCLUDES
 ****************************************************************************************
 */

#include <stdint.h>
#include <stdlib.h>
#include <stddef.h>     // standard definitions
#include <stdbool.h>    // boolean definition
#include "arch.h"
#include "arch_api.h"
#include "boot.h"       // boot definition
#include "rwip.h"       // BLE initialization
#include "syscntl.h"    // System control initialization
#include "em_map_ble.h"
#include "ke_mem.h"
#include "ke_event.h"
#include <user_periph_setup.h>

#include "uart.h"   // UART initialization
#include "nvds.h"   // NVDS initialization
#include "rf.h"     // RF initialization
#include "app.h"    // application functions
#include "dbg.h"    // For dbg_warning function

#include "datasheet.h"

#include "em_map_ble.h"

#include "lld_sleep.h"
#include "rwble.h"
#include "rf_585.h"
#include "gpio.h"

#include "lld_evt.h"
#include "arch_console.h"

#include "arch_system.h"

#include "system_library.h"

#include "arch_wdg.h"

#include <user_callback_config.h>

#include "ea.h"

#include "arch_ram.h"

/**
 * @addtogroup DRIVERS
 * @{
 */

/*
 * DEFINES
 ****************************************************************************************
 */

/*
 * STRUCTURE DEFINITIONS
 ****************************************************************************************
 */

/*
 * GLOBAL VARIABLE DEFINITIONS
 ****************************************************************************************
 */

extern struct arch_sleep_env_tag sleep_env;

extern last_ble_evt arch_rwble_last_event;

uint32_t code_size                      __attribute__((section("retention_mem_area0"), zero_init));
uint8_t ret_mode_for_non_ret_heap       __attribute__((section("retention_mem_area0"), zero_init));
uint8_t ret_mode                        __attribute__((section("retention_mem_area0"), zero_init));
uint8_t ret_mode_for_ret_data           __attribute__((section("retention_mem_area0"), zero_init));
uint8_t reinit_non_ret_heap             __attribute__((section("retention_mem_area0"), zero_init));

/*
 * LOCAL FUNCTION DECLARATIONS
 ****************************************************************************************
 */
static inline void otp_prepare(uint32_t code_size);
static inline bool ble_is_powered(void);
static inline void ble_turn_radio_off(void);
static inline void schedule_while_ble_on(void);
static inline sleep_mode_t ble_validate_sleep_mode(sleep_mode_t current_sleep_mode);
static inline void arch_turn_peripherals_off(sleep_mode_t current_sleep_mode);
static inline void arch_goto_sleep(sleep_mode_t current_sleep_mode);
static inline void arch_switch_clock_goto_sleep(sleep_mode_t current_sleep_mode);
static inline void arch_resume_from_sleep(void);
static inline sleep_mode_t rwip_power_down(void);
static inline arch_main_loop_callback_ret_t app_asynch_trm(void);
static inline arch_main_loop_callback_ret_t app_asynch_proc(void);
static inline void app_asynch_sleep_proc(void);
static inline void app_sleep_prepare_proc(sleep_mode_t *sleep_mode);
static inline void app_sleep_exit_proc(void);
static inline void app_sleep_entry_proc(sleep_mode_t sleep_mode);
static inline void init_retention_mode(void);

#if !defined (CFG_CUSTOM_SCATTER_FILE)
static inline uint8_t get_retention_mode(void);
static inline uint8_t get_retention_mode_data(void);
#endif
static inline uint8_t get_retention_mode_non_ret_heap(void);


/*
 * MAIN FUNCTION
 ****************************************************************************************
 */

/**
 ****************************************************************************************
 * @brief BLE main function.
 *        This function is called right after the booting process has completed.
 *        It contains the main function loop.
 ****************************************************************************************
 */
int main(void) __attribute__((noreturn));

#if defined(MEASURE_CPU_LOAD) && DEVELOPMENT_DEBUG
    #define SMOOTHING_FACTOR 64
    uint8_t cpu_load_index                     __attribute__((section("retention_mem_area0"), zero_init));
    uint8_t cpu_load                           __attribute__((section("retention_mem_area0"), zero_init));
    uint32_t cpu_load_active[SMOOTHING_FACTOR] __attribute__((section("retention_mem_area0"), zero_init));
    uint32_t cpu_load_idle[SMOOTHING_FACTOR]   __attribute__((section("retention_mem_area0"), zero_init));
    uint32_t cpu_load_prev_timestamp           __attribute__((section("retention_mem_area0"), zero_init));
    
    uint32_t get_timestamp(void)
    {
        uint32_t ea_time_get_halfslot_rounded(void);   
        return ea_time_get_halfslot_rounded();
//        uint32_t value = (GetWord16(CLK_REF_VAL_H_REG) << 16) + GetWord16(CLK_REF_VAL_L_REG);
//        SetWord16(CLK_REF_SEL_REG, 0); // select xtal32kHz oscillator, start!
//        SetWord16(CLK_REF_CNT_REG, 0x0);
//        while(GetBits16(CLK_REF_SEL_REG, REF_CAL_START) == 1);
//        SetWord16(CLK_REF_CNT_REG, 0xFFFF);
//        SetWord16(CLK_REF_SEL_REG, 6); 
        
//        return value;        
    }
#endif                

int main(void)
{
    sleep_mode_t sleep_mode;
    
    // initialize retention mode
    init_retention_mode();

    //global initialise
    system_init();

    /*
     ************************************************************************************
     * Platform initialization
     ************************************************************************************
     */

    while(1)
    {
        do {
            // schedule all pending events
            schedule_while_ble_on();
        }
        while (app_asynch_proc() != GOTO_SLEEP);    //grant control to the application, try to go to power down
                                                    //if the application returns GOTO_SLEEP

        //wait for interrupt and go to sleep if this is allowed
        if (((!BLE_APP_PRESENT) && (check_gtl_state())) || (BLE_APP_PRESENT))
        {
            //Disable the interrupts
            GLOBAL_INT_STOP();

