trevorcmit/DA14585_RCU/SDK_585/sdk/platform/arch/main/arch_main.c
            app_asynch_sleep_proc();

#if defined(MEASURE_CPU_LOAD) && DEVELOPMENT_DEBUG
            uint32_t current;
            // get the timestamp before powering-off the BLE
            if(GetBits16(CLK_RADIO_REG, BLE_ENABLE) != 0) {
                current = get_timestamp();
            }
#endif            
            // get the allowed sleep mode
            // time from rwip_power_down() to WFI() must be kept as short as possible!!
            sleep_mode = rwip_power_down();

            sleep_mode_t temp_sleep_mode = sleep_mode;
            app_sleep_prepare_proc(&temp_sleep_mode);
            if(temp_sleep_mode == mode_active) {
                sleep_mode = mode_active;
            }                
            
            if(arch_printf_transfer_pending() == true) {
                sleep_mode = mode_active;
            }                
            
            if ((sleep_mode == mode_ext_sleep) || (sleep_mode == mode_ext_sleep_otp_copy))
            {
#if defined(INDICATE_IDLE_STATE) && DEVELOPMENT_DEBUG
                GPIO_ConfigurePin(IDLE_INDICATION_PORT, IDLE_INDICATION_PIN, OUTPUT, PID_GPIO, true );
#endif        
#if defined(MEASURE_CPU_LOAD) && DEVELOPMENT_DEBUG
                cpu_load_index = 0;
//                cpu_load_active[cpu_load_index] = current - cpu_load_prev_timestamp;
//                if(cpu_load_prev_timestamp != 0 && cpu_load_active[cpu_load_index] > 0x150) {
//                    ASSERT_ERROR(0);
//                }

//                cpu_load_prev_timestamp = current;
#endif                
                //power down the radio and whatever is allowed
                arch_goto_sleep(sleep_mode);

                // In extended sleep mode the watchdog timer is disabled
                // (power domain PD_SYS is automatically OFF). Although, if the debugger
                // is attached the watchdog timer remains enabled and must be explicitly
                // disabled.
                if ((GetWord16(SYS_STAT_REG) & DBG_IS_UP) == DBG_IS_UP)
                {
                    wdg_freeze();    // Stop watchdog timer
                }
                
                //wait for an interrupt to resume operation
                WFI();

                //resume operation
                arch_resume_from_sleep();
            }
            else if (sleep_mode == mode_idle)
            {
                if (((!BLE_APP_PRESENT) && check_gtl_state()) || (BLE_APP_PRESENT))
                {   
#if defined(INDICATE_IDLE_STATE) && DEVELOPMENT_DEBUG                   
                    GPIO_ConfigurePin(IDLE_INDICATION_PORT, IDLE_INDICATION_PIN, OUTPUT, PID_GPIO, true );
#endif                
#if defined(MEASURE_CPU_LOAD) && DEVELOPMENT_DEBUG
                    bool measure = false;
                    if(GetBits16(CLK_RADIO_REG, BLE_ENABLE) != 0) {
                        measure = true;
                        cpu_load_active[cpu_load_index] = current - cpu_load_prev_timestamp;
                        cpu_load_prev_timestamp = current;
                    }
#endif                
                    //wait for an interrupt to resume operation
                    WFI();
#if defined(MEASURE_CPU_LOAD) && DEVELOPMENT_DEBUG
                    if(measure == true) {
                        current = get_timestamp();
                        cpu_load_idle[cpu_load_index] = current - cpu_load_prev_timestamp;
                        cpu_load_prev_timestamp = current;
                        cpu_load_index++;
                        if(cpu_load_index == SMOOTHING_FACTOR) {
                                cpu_load_index = 0;
                        }
                        
                        if(cpu_load_index == 0) {
                            uint32_t idle=0, active=0;
                            for(int i=1; i<SMOOTHING_FACTOR; i++) { // Drop the first sample
                                idle+= cpu_load_idle[i];
                                active+= cpu_load_active[i];
                            }
                            cpu_load = active*100 / (active+idle);
                        }
                    }
#endif                         
                }
            }
#if defined(INDICATE_IDLE_STATE) && DEVELOPMENT_DEBUG
            GPIO_ConfigurePin(IDLE_INDICATION_PORT, IDLE_INDICATION_PIN, OUTPUT, PID_GPIO, false );
#endif                           
            // restore interrupts
            GLOBAL_INT_START();
        }
        wdg_reload(WATCHDOG_DEFAULT_PERIOD);
    }
}

/**
 ****************************************************************************************
 * @brief Power down the BLE Radio and whatever is allowed according to the sleep mode and
 *        the state of the system and application
 * @param[in] current_sleep_mode The current sleep mode proposed by the application.
 * @return void
 ****************************************************************************************
 */
static inline void arch_goto_sleep (sleep_mode_t current_sleep_mode)
{
    sleep_mode_t sleep_mode = current_sleep_mode;

    ble_turn_radio_off ( );
    //turn the radio off and check if we can go into deep sleep
    sleep_mode = ble_validate_sleep_mode(sleep_mode);

    // grant access to the application to check if we can go to sleep
    app_sleep_prepare_proc(&sleep_mode);    //SDK Improvements for uniformity this one should be changed?

    //turn the peripherals off according to the current sleep mode
    arch_turn_peripherals_off(sleep_mode);

    // hook for app specific tasks just before sleeping
    app_sleep_entry_proc(sleep_mode);

    #if ((EXTERNAL_WAKEUP) && (!BLE_APP_PRESENT)) // external wake up, only in external processor designs
        ext_wakeup_enable(EXTERNAL_WAKEUP_GPIO_PORT, EXTERNAL_WAKEUP_GPIO_PIN, EXTERNAL_WAKEUP_GPIO_POLARITY);
    #endif

    // do the last house keeping of the clocks and go to sleep
    arch_switch_clock_goto_sleep (sleep_mode);
}

/**
 ****************************************************************************************
 * @brief Manage the clocks and go to sleep.
 * @param[in] current_sleep_mode The current sleep mode proposed by the system so far
 * @return void
 ****************************************************************************************
 */
static inline void arch_switch_clock_goto_sleep(sleep_mode_t current_sleep_mode)
{
    if ( (current_sleep_mode == mode_ext_sleep) || (current_sleep_mode == mode_ext_sleep_otp_copy) )
    {
        SetBits16(CLK_16M_REG, XTAL16_BIAS_SH_ENABLE, 0);      // Set BIAS to '0' if sleep has been decided

        if (USE_POWER_OPTIMIZATIONS)
        {
            clk_freq_trim_reg_value = GetWord16(CLK_FREQ_TRIM_REG); // store used trim value

            SetBits16(CLK_16M_REG, RC16M_ENABLE, 1);                // Enable RC16

            for (volatile int i = 0; i < 20; i++);

            SetBits16(CLK_CTRL_REG, SYS_CLK_SEL, 1);                // Switch to RC16

            while( (GetWord16(CLK_CTRL_REG) & RUNNING_AT_RC16M) == 0 );

            // Do not disable XTAL16M! It will be disabled when we sleep...
            SetWord16(CLK_FREQ_TRIM_REG, 0x0000);                   // Set zero value to CLK_FREQ_TRIM_REG
        }
    }
}

/**
 ****************************************************************************************
 * @brief  An interrupt came, resume from sleep.
 * @return void
 ****************************************************************************************
 */
static inline void arch_resume_from_sleep(void)
{
    // Check if non retained heap should be re-initialized
    if (reinit_non_ret_heap)
    {
        ke_mem_init(KE_MEM_NON_RETENTION, (uint8_t*)(rom_cfg_table[rwip_heap_non_ret_pos]), rom_cfg_table[rwip_heap_non_ret_size]);
    }

    // hook for app specific tasks just after waking up
    app_sleep_exit_proc( );

