trevorcmit/DA14585_RCU/SDK_585/sdk/platform/arch/main/arch_main.c
#if ((EXTERNAL_WAKEUP) && (!BLE_APP_PRESENT)) // external wake up, only in external processor designs
    // Disable external wakeup interrupt
    ext_wakeup_disable();
#endif

    // restore ARM Sleep mode
    // reset SCR[2]=SLEEPDEEP bit else the mode=idle WFI will cause a deep sleep
    // instead of a processor halt
    SCB->SCR &= ~(1<<2);
}

/**
 ****************************************************************************************
 * @brief Check if the BLE module is powered on.
 * @return void
 ****************************************************************************************
 */
static inline bool ble_is_powered()
{
    return ((GetBits16(CLK_RADIO_REG, BLE_ENABLE) == 1) &&
            (GetBits32(BLE_DEEPSLCNTL_REG, DEEP_SLEEP_STAT) == 0) &&
            !(rwip_prevent_sleep_get() & RW_WAKE_UP_ONGOING));
}

/**
 ****************************************************************************************
 * @brief Call the scheduler if the BLE module is powered on.
 * @return void
 ****************************************************************************************
 */
static inline void schedule_while_ble_on(void)
{
    // BLE clock is enabled
    while (ble_is_powered())
    {
        //execute messages and events
        rwip_schedule();

#if (!FPGA)
        if (arch_rwble_last_event == BLE_EVT_END)
        {
           uint32_t sleep_duration = 0;
           rcx20_read_freq();

            //if you have enough time run a temperature calibration of the radio
            if (ea_sleep_check(&sleep_duration, 4)) //6 slots -> 3.750 ms
                // check time and temperature to run radio calibrations.
                conditionally_run_radio_cals();
        }
#endif // (!FPGA)

        //grant control to the application, try to go to sleep
        //if the application returns GOTO_SLEEP
        if (app_asynch_trm() != GOTO_SLEEP)
        {
            continue; // so that rwip_schedule() is called again
        }
        else
        {
            arch_printf_process();
            break;
        }
    }
}

/**
 ****************************************************************************************
 * @brief Power down the ble ip if possible.
 * @return sleep_mode_t return the current sleep mode
 ****************************************************************************************
 */
static inline sleep_mode_t rwip_power_down(void)
{
    sleep_mode_t sleep_mode;
    // if app has turned sleep off, rwip_sleep() will act accordingly
    // time from rwip_sleep() to WFI() must be kept as short as possible!
    sleep_mode = rwip_sleep();

    // BLE is sleeping ==> app defines the mode
    if (sleep_mode == mode_sleeping) {
        if (sleep_env.slp_state == ARCH_EXT_SLEEP_ON) {
            sleep_mode = mode_ext_sleep;
        } else {
            sleep_mode = mode_ext_sleep_otp_copy;
        }
    }
    return (sleep_mode);
}

/**
 ****************************************************************************************
 * @brief Turn the radio off.
 * @return void
 ****************************************************************************************
 */
static inline void ble_turn_radio_off(void)
{
    SetBits16(PMU_CTRL_REG, RADIO_SLEEP, 1); // turn off radio
}

/**
 ****************************************************************************************
 * @brief Validate that we can use the proposed sleep mode.
 * @param[in] current_sleep_mode The current sleep mode proposed by the system so far
 * @return sleep_mode_t return the allowable sleep mode
 ****************************************************************************************
 */
static inline sleep_mode_t ble_validate_sleep_mode(sleep_mode_t current_sleep_mode)
{
    return current_sleep_mode;
}

/**
 ****************************************************************************************
 * @brief Initialize retention mode.
 * @return void
 ****************************************************************************************
 */
static inline void init_retention_mode(void)
{
#if defined (CFG_CUSTOM_SCATTER_FILE)
    // User selects which RAM blocks to retain (code and retention data or only retention data)
    ret_mode = ret_mode_for_ret_data = (RETAIN_RAM_1_BLOCK |
                                        RETAIN_RAM_2_BLOCK |
                                        RETAIN_RAM_3_BLOCK |
                                        RETAIN_RAM_4_BLOCK);
#else
    // RAM retention mode for code and retention data
    ret_mode = get_retention_mode();
    
    // RAM retention mode for retention data only
    ret_mode_for_ret_data = get_retention_mode_data();
#endif
    // RAM retention mode for the non retainable heap data only
    ret_mode_for_non_ret_heap = get_retention_mode_non_ret_heap();
}

/**
 ****************************************************************************************
 * @brief Define which RAM blocks will be retained based on the base address of the 
 *        retention data which touch the aforementioned RAM blocks.
 *        The RAM_4 block is always retained.
 * @return the retention mode (the RAM blocks to be retained)
 * @note This function is strongly related to the default SDK scatter file structure.
 ****************************************************************************************
 */
#if !defined (CFG_CUSTOM_SCATTER_FILE)
static inline uint8_t get_retention_mode_data(void)
{
    uint32_t ret_mem_base_addr = (uint32_t) &Image$$RET_DATA_UNINIT$$Base;
    
    // Check the base address of the retention data
    if (ret_mem_base_addr >= RAM_4_BASE_ADDR)
    {
        // Retain RAM_4 block
        return (RETAIN_RAM_4_BLOCK);
    }
    else if(ret_mem_base_addr >= RAM_3_BASE_ADDR)
    {
        // Retain RAM_3 and RAM_4 block
        return (RETAIN_RAM_3_BLOCK |
                RETAIN_RAM_4_BLOCK);
    }
    else if (ret_mem_base_addr >= RAM_2_BASE_ADDR)
    {
        // Retain RAM_2, RAM_3 and RAM_4 block
        return (RETAIN_RAM_2_BLOCK |
                RETAIN_RAM_3_BLOCK |
                RETAIN_RAM_4_BLOCK);
    }
    else
    {
        // Retain all RAM blocks
        return (RETAIN_RAM_1_BLOCK |
                RETAIN_RAM_2_BLOCK |
                RETAIN_RAM_3_BLOCK |
                RETAIN_RAM_4_BLOCK);
    }
}

/**
 ****************************************************************************************
 * @brief Define which RAM blocks will be retained based on the code and the retention
 *        data size.
 *        The RAM_4 block is always retained.
 * @return the retention mode (the RAM blocks to be retained)
 * @note This function is strongly related to the default SDK scatter file.
 ****************************************************************************************
 */
static inline uint8_t get_retention_mode(void)
{
    // The following equation calculates the code size and is strongly related to the 
    // default SDK scatter file structure
    code_size = ((uint32_t) &Image$$ER_IROM3$$Base - RAM_1_BASE_ADDR) + (uint32_t) &Image$$ER_IROM3$$Length;
    
