trevorcmit/DA14585_RCU/SDK_585/sdk/platform/arch/main/arch_main.c
    // Check the code size
    if (code_size <= (RAM_2_BASE_ADDR - RAM_1_BASE_ADDR))
    {
        // Code fits in RAM_1 block
        return (RETAIN_RAM_1_BLOCK |
                get_retention_mode_data());
    }
    else if ((code_size > (RAM_2_BASE_ADDR - RAM_1_BASE_ADDR)) && code_size <= (RAM_3_BASE_ADDR - RAM_1_BASE_ADDR))
    {
        // Code fits in RAM_1 block and RAM_2 block
        return (RETAIN_RAM_1_BLOCK |
                RETAIN_RAM_2_BLOCK |
                get_retention_mode_data());
    }
    else
    {
        // Retain all RAM blocks
        return (RETAIN_RAM_1_BLOCK |
                RETAIN_RAM_2_BLOCK |
                RETAIN_RAM_3_BLOCK |
                RETAIN_RAM_4_BLOCK);
    }
}
#endif // CFG_CUSTOM_SCATTER_FILE

/**
 ****************************************************************************************
 * @brief Calculate the RAM blocks which will be retained depending on the non retained
 *        heap base address and size.
 * @return the retention mode (the RAM blocks to be retained)
 ****************************************************************************************
 */
static inline uint8_t get_retention_mode_non_ret_heap()
{
    uint32_t non_ret_heap_base = (uint32_t) &heap_mem_area_not_ret$$Base;
    uint32_t non_ret_heap_length = (uint32_t) &heap_mem_area_not_ret$$Length;
    
    if (non_ret_heap_base >= RAM_4_BASE_ADDR)
    {
        return (RETAIN_RAM_4_BLOCK);
    }
    else if (non_ret_heap_base >= RAM_3_BASE_ADDR)
    {
        if (non_ret_heap_base + non_ret_heap_length < RAM_4_BASE_ADDR)
        {
            return (RETAIN_RAM_3_BLOCK);
        }
        else
        {
            return (RETAIN_RAM_3_BLOCK |
                    RETAIN_RAM_4_BLOCK);
        }
    }
    else if (non_ret_heap_base >= RAM_2_BASE_ADDR)
    {
        if (non_ret_heap_base + non_ret_heap_length < RAM_3_BASE_ADDR)
        {
            return (RETAIN_RAM_2_BLOCK);
        }
        else if (non_ret_heap_base + non_ret_heap_length < RAM_4_BASE_ADDR)
        {
            return (RETAIN_RAM_2_BLOCK |
                    RETAIN_RAM_3_BLOCK);
        }
        else
        {
            return (RETAIN_RAM_2_BLOCK |
                    RETAIN_RAM_3_BLOCK |
                    RETAIN_RAM_4_BLOCK);
        }
    }
    else
    {
        if (non_ret_heap_base + non_ret_heap_length < RAM_2_BASE_ADDR)
        {
            return (RETAIN_RAM_1_BLOCK);
            
        }
        else if (non_ret_heap_base + non_ret_heap_length < RAM_3_BASE_ADDR)
        {
            return (RETAIN_RAM_1_BLOCK |
                    RETAIN_RAM_2_BLOCK);
            
        }
        else if (non_ret_heap_base + non_ret_heap_length < RAM_4_BASE_ADDR)
        {
            return (RETAIN_RAM_1_BLOCK |
                    RETAIN_RAM_2_BLOCK |
                    RETAIN_RAM_3_BLOCK);
        }
        else
        {
            return (RETAIN_RAM_1_BLOCK |
                    RETAIN_RAM_2_BLOCK |
                    RETAIN_RAM_3_BLOCK |
                    RETAIN_RAM_4_BLOCK);
        }
    }
}

/**
 ****************************************************************************************
 * @brief  Turn the peripherals off according to the current sleep mode.
 * @param[in] current_sleep_mode The current sleep mode proposed by the system so far
 * @return void
 ****************************************************************************************
 */
static inline void arch_turn_peripherals_off (sleep_mode_t current_sleep_mode)
{
    if (current_sleep_mode == mode_ext_sleep || current_sleep_mode == mode_ext_sleep_otp_copy)
    {
        SCB->SCR |= 1<<2; // enable deep sleep  mode bit in System Control Register (SCR[2]=SLEEPDEEP)

        SetBits16(SYS_CTRL_REG, PAD_LATCH_EN, 0);          // activate PAD latches
        SetBits16(PMU_CTRL_REG, PERIPH_SLEEP, 1);          // turn off peripheral power domain
        if (current_sleep_mode == mode_ext_sleep)
        {
            /*
             * Sleep mode: EXTENDED - image kept at external resource
             * 
             * The RAM blocks that hold the code and the retention data
             * must be retained.
             */
            
            // OTP copy and OTP copy emulation will be disabled
            SetBits16(SYS_CTRL_REG, OTP_COPY, 0);
            
            // dynamically select the retained RAM blocks
            SetBits16(PMU_CTRL_REG, RETENTION_MODE, ret_mode);
        }
        else
        {
            /*
             * Sleep mode: EXTENDED - image kept at OTP (OTP mirroring takes place on wake-up)
             * 
             * The RAM blocks that hold the retention data must be retained.
             */
            
#if DEVELOPMENT_DEBUG

            // enable OTP copy emulation
            SetBits16(SYS_CTRL_REG, OTP_COPY, 1);
            SetBits16(SYS_CTRL_REG, DEV_PHASE, 1);
            
            // dynamically select the retained RAM blocks
            SetBits16(PMU_CTRL_REG, RETENTION_MODE, ret_mode);
#else
            // enable OTP copy
            SetBits16(SYS_CTRL_REG, DEV_PHASE, 0);
            SetBits16(PMU_CTRL_REG, RETENTION_MODE, ret_mode_for_ret_data);
#endif
            otp_prepare((code_size + 3) >> 2);       // convert function argument from bytes to 32-bit words
        }

        // manage the non retained heap
        if (!ke_mem_is_empty(KE_MEM_NON_RETENTION))
        {
            reinit_non_ret_heap = 0;
            SetBits16(PMU_CTRL_REG, RETENTION_MODE, ret_mode_for_non_ret_heap | GetBits16(PMU_CTRL_REG, RETENTION_MODE));
        }
        else
        {
            reinit_non_ret_heap = 1;
        }
    }
}

/**
 ****************************************************************************************
 * @brief Prepare OTP Controller in order to be able to reload SysRAM at the next power-up.
 ****************************************************************************************
 */
static inline void otp_prepare(uint32_t code_size)
{
    // Enable OPTC clock in order to have access
    SetBits16 (CLK_AMBA_REG, OTP_ENABLE, 1);

